bit-finance/Catalogs/бит_ЭлементыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЭлементыДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_СпособыКомпоновкиИсточниковДанных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеМногоязычное</Name>
					<Comment>Наименование (на различных языках)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Кодификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГруппы</Name>
					<Comment>Вид группы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыГруппДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Comment>Настройки построителя</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигНесинхронный</Name>
					<Comment>Сдвиг несинхронный</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДат</Name>
					<Comment>Сдвиг дат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигДатКон</Name>
					<Comment>Сдвиг дат кон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто1</Name>
					<Comment>Вид субконто1</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто2</Name>
					<Comment>Вид субконто2</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто3</Name>
					<Comment>Вид субконто3</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконто4</Name>
					<Comment>Вид субконто4</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_2</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_4</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоБюджетирования</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_5</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_3</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыСубконтоДополнительные_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Comment>Представление отбора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Отключено</Name>
					<Comment>Отключено</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборВОтчете</Name>
					<Comment>Хранилище отбор в отчете</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетРасшифровка</Name>
					<Comment>Отчет расшифровка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьВОтчет</Name>
					<Comment>Не выводить в отчет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Comment>Вид информационной базы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Comment>Подключение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиРасчетаДляФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаРасчета</Name>
							<Comment>Строка расчета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыПересчетаПоКурсам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПересчетаПоКурсам</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыПересчетаПоКурсам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Enums/бит_ВидыГруппДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыГруппДанных</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыборкаДанных</Name>
					<Comment>Выборка данных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Группировка</Name>
					<Comment>Группировка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
					<Comment>Формула</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
					<Comment>Текст</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_ЭлементыДанных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Представление отбора.
	Если ВидГруппы = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных Тогда				
		ТекНастройкиПостроителя = НастройкиПостроителя.Получить();  		
		Если ТипЗнч(ТекНастройкиПостроителя) = Тип("Структура") Тогда			
			ПредставлениеОтбора = бит_МеханизмПолученияДанных.СформироватьТекстНастроек(ТекНастройкиПостроителя.Отбор);  						
		КонецЕсли; 		
	КонецЕсли;
	
	// Проверка на подчинение только группам.
	Если ЗначениеЗаполнено(Родитель) И Родитель.ВидГруппы <> Перечисления.бит_ВидыГруппДанных.Группировка Тогда
		ТекстСообщения = НСтр("ru = 'Элемент данных может быть подчинен только элементам вида ""Группировка"".';
							  |en = 'A data element can only be subordinate to elements of the ""Grouping"" type.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ); 
	КонецЕсли; 
	
	// Проверка вида у элемента данных, содержащих подчиненные.
	Если НЕ ЭтоНовый() И  ВидГруппы <> Перечисления.бит_ВидыГруппДанных.Группировка Тогда
		 Запрос = Новый Запрос;
		 Запрос.Текст =  "
		 |ВЫБРАТЬ ПЕРВЫЕ 1
         |	бит_ЭлементыДанных.Ссылка
         |ИЗ
         |	Справочник.бит_ЭлементыДанных КАК бит_ЭлементыДанных
         |ГДЕ
         |	бит_ЭлементыДанных.Владелец = &Владелец
         |	И бит_ЭлементыДанных.Ссылка В ИЕРАРХИИ(&Родитель)
         |	И бит_ЭлементыДанных.Ссылка <> &Родитель
		 |";                						 
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Родитель", Ссылка);
		
		Результат = Запрос.Выполнить();  		
		Выборка   = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			ТекстСообщения = НСтр("ru = 'Только элемент вида ""Группировка"" может содержать подчиненные элементы данных.';
								  |en = 'Only an element of the ""Grouping"" type can contain subordinate data elements.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);			
		КонецЕсли; 
	КонецЕсли; 
		
	// Проверка формулы.
	Если ВидГруппы = Перечисления.бит_ВидыГруппДанных.Формула Тогда
	
		Для каждого СтрокаОперанд Из СтрокиРасчетаДляФормулы Цикл
			// Проверка на наличие элементов-родителей в формуле.
			Если ПринадлежитЭлементу(СтрокаОперанд.СтрокаРасчета) Тогда
				ТекстСообщения = НСтр("ru = 'Элемент данных ""%1"" не может быть использован в формуле, так как он является родителем данной формулы.';
									  |en = 'The ""%1"" data element cannot be used in the formula because it is the parent of this formula.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаОперанд.СтрокаРасчета);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);		
			КонецЕсли;    			 
		КонецЦикла; 
		
		// Проверка на перекрестное использование формул.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиРасчетаДляФормулы.СтрокаРасчета.Ссылка КАК Операнд,
		|	СтрокиРасчетаДляФормулы.Ссылка КАК ЭлементДанных
		|ИЗ
		|	Справочник.бит_ЭлементыДанных.СтрокиРасчетаДляФормулы КАК СтрокиРасчетаДляФормулы
		|ГДЕ
		|	СтрокиРасчетаДляФормулы.Ссылка В ИЕРАРХИИ(&МассивОперандов)
		|	И СтрокиРасчетаДляФормулы.Ссылка.Владелец = &Владелец
		|	И СтрокиРасчетаДляФормулы.Ссылка.ВидГруппы = ЗНАЧЕНИЕ(Перечисление.бит_ВидыГруппДанных.Формула)";
					   
		Запрос.УстановитьПараметр("Владелец"	   , Владелец);
		Запрос.УстановитьПараметр("МассивОперандов", СтрокиРасчетаДляФормулы.ВыгрузитьКолонку("СтрокаРасчета"));
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ПринадлежитЭлементу(Выборка.Операнд) Тогда				
				ТекстСообщения = НСтр("ru='Обнаружены перекрестные ссылки в формулах. Формула ""%1"" использует в качестве операнда элемент данных ""%2"".';
									  |en='Cross-references were found in formulas. The formula ""%1"" uses the data element ""%2"" as the operand.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ЭлементДанных, Выборка.Операнд);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			КонецЕсли; 
		КонецЦикла;		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
	СтруктураОформления = Новый Структура();
	СтруктураОформления.Вставить("ЦветФона"  			  , ЦветаСтиля.ЦветОсобогоТекста);
	СтруктураОформления.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Авто);
	ХранилищеДанных = Новый ХранилищеЗначения(СтруктураОформления, Новый СжатиеДанных(9));
	Оформление = ХранилищеДанных;	
	
	Коэффициент = 1;
	
	Если НЕ ЗначениеЗаполнено(ВидГруппы) И ЗначениеЗаполнено(Родитель) Тогда
		ВидГруппыРодителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ВидГруппы");
		Если ВидГруппыРодителя = Перечисления.бит_ВидыГруппДанных.Группировка Тогда
			ВидГруппы = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных;
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(ВидГруппы) Тогда
		ВидГруппы  = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных;
	КонецЕсли; 

	Если ВидГруппы  = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных Тогда
		ЗаполнитьПоВладельцу();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидГруппы = Перечисления.бит_ВидыГруппДанных.Текст Тогда
		
		бит_РаботаСКоллекциями.УдалитьЭлементМассиваПоЗначению(ПроверяемыеРеквизиты, "Наименование"); 	
		
	ИначеЕсли ВидГруппы = Перечисления.бит_ВидыГруппДанных.ВыборкаДанных Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВидИнформационнойБазы");
		ПроверяемыеРеквизиты.Добавить("ИсточникДанных");
		
		Если Не ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза Тогда 			
			ПроверяемыеРеквизиты.Добавить("НастройкаПодключения");       			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройкиПостроителя() Экспорт

	Возврат Справочники.бит_ЭлементыДанных.ПолучитьНастройкиПостроителя(Ссылка);
	
КонецФункции

Процедура СохранитьНастройкиПостроителя(СтруктураНастроек)  Экспорт

	 НастройкиПостроителя = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных(9));

КонецПроцедуры

Функция ПолучитьОтборВОтчете()  Экспорт
	
	ТабОтборВОтчете = ХранилищеОтборВОтчете.Получить();

	Возврат ТабОтборВОтчете;
	
КонецФункции

Процедура СохранитьОтборВОтчете(ОтборВОтчете) Экспорт

    ХранилищеОтборВОтчете = Новый ХранилищеЗначения(ОтборВОтчете, Новый СжатиеДанных(9));	

КонецПроцедуры

Функция ПолучитьНастройкиОформления()  Экспорт

	НастройкиОформления = Оформление.Получить();
	
	Возврат НастройкиОформления;

КонецФункции

Процедура СохранитьНастройкиОформления(НастройкиОФормления) Экспорт

	Оформление = Новый ХранилищеЗначения(НастройкиОФормления, Новый СжатиеДанных(9));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоВладельцу()

	Если ЗначениеЗаполнено(Владелец) Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.ИсточникДанных КАК ИсточникДанных,
		|	ИсточникиДанных.НастройкаПодключения,
		|	ИсточникиДанных.ВидИнформационнойБазы
		|ИЗ
		|	Справочник.бит_СпособыКомпоновкиИсточниковДанных.ИсточникиДанных КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ИсточникиДанных КАК ИсточникиДанных
		|		ПО Таблица.ИсточникДанных = ИсточникиДанных.Ссылка
		|ГДЕ
		|	Таблица.Ссылка = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка			 = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			Если НЕ ЗначениеЗаполнено(ВидИнформационнойБазы) Тогда
				ВидИнформационнойБазы = Выборка.ВидИнформационнойБазы;
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(НастройкаПодключения) Тогда
				НастройкаПодключения  = Выборка.НастройкаПодключения;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ИсточникДанных) Тогда
				ИсточникДанных		  = Выборка.ИсточникДанных;
			КонецЕсли; 
		
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
